In [120]:
# QUESTION 1
a = 0 
def b():
 global a 
 a = c(a)
def c(a): 
 return a + 2

In [121]:
b()

In [122]:
a

2

In [48]:
# QUESTION 5
def binary(n):
    s = str(n % 2)

    if n >> 1 > 0:
        s += binary(n >> 1)

    return s

In [49]:
binary(0)

'0'

In [50]:
binary(1)

'1'

In [51]:
binary(3)

'11'

In [52]:
binary(9)

'1001'

In [57]:
!pip install ipython-sql

Requirement already satisfied: ipython-sql in c:\users\taniya laptop\anaconda3\lib\site-packages (0.4.0)
Requirement already satisfied: ipython-genutils>=0.1.0 in c:\users\taniya laptop\anaconda3\lib\site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: sqlparse in c:\users\taniya laptop\anaconda3\lib\site-packages (from ipython-sql) (0.4.1)
Requirement already satisfied: ipython>=1.0 in c:\users\taniya laptop\anaconda3\lib\site-packages (from ipython-sql) (7.19.0)
Requirement already satisfied: prettytable<1 in c:\users\taniya laptop\anaconda3\lib\site-packages (from ipython-sql) (0.7.2)
Requirement already satisfied: six in c:\users\taniya laptop\anaconda3\lib\site-packages (from ipython-sql) (1.15.0)
Requirement already satisfied: sqlalchemy>=0.6.7 in c:\users\taniya laptop\anaconda3\lib\site-packages (from ipython-sql) (1.3.20)
Requirement already satisfied: pickleshare in c:\users\taniya laptop\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.7.5)
Requirement already satisfied: pygments in c:\users\taniya laptop\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (2.7.2)
Requirement already satisfied: backcall in c:\users\taniya laptop\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.2.0)
Requirement already satisfied: traitlets>=4.2 in c:\users\taniya laptop\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (5.0.5)
Requirement already satisfied: decorator in c:\users\taniya laptop\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (4.4.2)
Requirement already satisfied: jedi>=0.10 in c:\users\taniya laptop\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.17.1)
Requirement already satisfied: colorama; sys_platform == "win32" in c:\users\taniya laptop\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.4.4)
Requirement already satisfied: setuptools>=18.5 in c:\users\taniya laptop\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (50.3.1.post20201107)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in c:\users\taniya laptop\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (3.0.8)
Requirement already satisfied: parso<0.8.0,>=0.7.0 in c:\users\taniya laptop\anaconda3\lib\site-packages (from jedi>=0.10->ipython>=1.0->ipython-sql) (0.7.0)
Requirement already satisfied: wcwidth in c:\users\taniya laptop\anaconda3\lib\site-packages (from prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0->ipython>=1.0->ipython-sql) (0.2.5)

In [62]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [68]:
%sql sqlite://

In [76]:
# QUESTION 8
%%sql   
CREATE TABLE Temp(City varchar(50), Country varchar(50), Season varchar(50),
                     Temperature_C varchar(50), Rainfall_mm varchar(50));

 * sqlite://
(sqlite3.OperationalError) table Temp already exists
[SQL: CREATE TABLE Temp(City varchar(50), Country varchar(50), Season varchar(50),
                     Temperature_C varchar(50), Rainfall_mm varchar(50));]
(Background on this error at: http://sqlalche.me/e/13/e3q8)

In [78]:
%%sql
INSERT INTO Temp VALUES('Mumbai','India','Winter','24.8','5.9');  
INSERT INTO Temp VALUES('Mumbai','India','Spring','28.4','16.2');
INSERT INTO Temp VALUES('Mumbai','India','Summer','27.9','1549.4');
INSERT INTO Temp VALUES('Mumbai','India','Fall','27.6','346.0');
INSERT INTO Temp VALUES('London','United Kingdom','Winter','4.2','207.7');
INSERT INTO Temp VALUES('London','United Kingdom','Spring','8.3','169.6');
INSERT INTO Temp VALUES('London','United Kingdom','Summer','15.7','157.0');
INSERT INTO Temp VALUES('London','United Kingdom','Fall','10.4','218.5');
INSERT INTO Temp VALUES('Cairo','Egypt','Winter','13.6','16.5');
INSERT INTO Temp VALUES('Cairo','Egypt','Spring','20.7','6.5');
INSERT INTO Temp VALUES('Cairo','Egypt','Summer','27.7','0.1');
INSERT INTO Temp VALUES('Cairo','Egypt','Fall','22.2','4.5');

 * sqlite://
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [79]:
%%sql
SELECT * FROM Temp;

 * sqlite://
Done.

[('Mumbai', 'India', 'Winter', '24.8', '5.9'),
 ('Mumbai', 'India', 'Spring', '28.4', '16.2'),
 ('Mumbai', 'India', 'Summer', '27.9', '1549.4'),
 ('Mumbai', 'India', 'Fall', '27.6', '346.0'),
 ('London', 'United Kingdom', 'Winter', '4.2', '207.7'),
 ('London', 'United Kingdom', 'Spring', '8.3', '169.6'),
 ('London', 'United Kingdom', 'Summer', '15.7', '157.0'),
 ('London', 'United Kingdom', 'Fall', '10.4', '218.5'),
 ('Cairo', 'Egypt', 'Winter', '13.6', '16.5'),
 ('Cairo', 'Egypt', 'Spring', '20.7', '6.5'),
 ('Cairo', 'Egypt', 'Summer', '27.7', '0.1'),
 ('Cairo', 'Egypt', 'Fall', '22.2', '4.5')]

In [80]:
%%sql
SELECT City, Country, Season, Temperature_C from Temp;

 * sqlite://
Done.

[('Mumbai', 'India', 'Winter', '24.8'),
 ('Mumbai', 'India', 'Spring', '28.4'),
 ('Mumbai', 'India', 'Summer', '27.9'),
 ('Mumbai', 'India', 'Fall', '27.6'),
 ('London', 'United Kingdom', 'Winter', '4.2'),
 ('London', 'United Kingdom', 'Spring', '8.3'),
 ('London', 'United Kingdom', 'Summer', '15.7'),
 ('London', 'United Kingdom', 'Fall', '10.4'),
 ('Cairo', 'Egypt', 'Winter', '13.6'),
 ('Cairo', 'Egypt', 'Spring', '20.7'),
 ('Cairo', 'Egypt', 'Summer', '27.7'),
 ('Cairo', 'Egypt', 'Fall', '22.2')]

In [83]:
%%sql
SELECT distinct(City), Country from Temp;

 * sqlite://
Done.

[('Mumbai', 'India'), ('London', 'United Kingdom'), ('Cairo', 'Egypt')]

In [84]:
%%sql
SELECT * from Temp
where Country = 'India';

 * sqlite://
Done.

[('Mumbai', 'India', 'Winter', '24.8', '5.9'),
 ('Mumbai', 'India', 'Spring', '28.4', '16.2'),
 ('Mumbai', 'India', 'Summer', '27.9', '1549.4'),
 ('Mumbai', 'India', 'Fall', '27.6', '346.0')]

In [85]:
%%sql
SELECT * from Temp
where Season = 'Fall';

 * sqlite://
Done.

[('Mumbai', 'India', 'Fall', '27.6', '346.0'),
 ('London', 'United Kingdom', 'Fall', '10.4', '218.5'),
 ('Cairo', 'Egypt', 'Fall', '22.2', '4.5')]

In [87]:
%%sql
SELECT City, Country, Season, Rainfall_mm from Temp
where Rainfall_mm > 200 AND Rainfall_mm < 400;

 * sqlite://
Done.

[('Mumbai', 'India', 'Fall', '346.0'),
 ('London', 'United Kingdom', 'Winter', '207.7'),
 ('London', 'United Kingdom', 'Fall', '218.5'),
 ('Cairo', 'Egypt', 'Fall', '4.5')]

In [91]:
%%sql
Select City, Country, Avg(Temperature_C) as Fall_temp from Temp
Group By Season
having Season = 'Fall' AND Fall_Temp > 20
Order BY Fall_temp ASC;

 * sqlite://
Done.

[('Mumbai', 'India', 20.066666666666666)]

In [94]:
%%sql
Select City, SUM(rainfall_mm) as Total_annual_rainfall from Temp
where City = 'Cairo';

 * sqlite://
Done.

[('Cairo', 27.6)]

In [95]:
%%sql
Select Season, SUM(rainfall_mm) as Total_annual_rainfall from Temp
Group By Season;

 * sqlite://
Done.

[('Fall', 569.0),
 ('Spring', 192.29999999999998),
 ('Summer', 1706.5),
 ('Winter', 230.1)]

In [110]:
# QUESTION 4
def collatz(n):
    while n > 1:
        print(n, end=' ')
        if (n % 2):
            # n is odd
            n = 3*n + 1
        else:
            # n is even
            n = n//2
    print(1, end='')

In [111]:
collatz(1)

1

In [112]:
collatz(10)

10 5 16 8 4 2 1

In [137]:
# QUESTION 2
def filelenght(filename):
    try:
        infile = open(filename)
        content = infile.read()
        infile.close()
        wordList = content.split()
        return len(wordList)
    except:
        print('File does not exist')
        
print(filelenght('import.txt'))
print(filelenght('impor.txt'))

File does not exist
None
File does not exist
None

In [145]:
#QUESTION 3
class Maruspial():
    def _init_(self, tmp_list=[]):
        self.tmp_list = tmp_list
        tmp + list=[]
    def put_in_pouch(self,str_param):
        self.tmp_list.append(str_param)
    def pouch_contents(self):
        return self.tmp_list
    
class kangaroo(Maruspial):
    def _init_(self,x_cord, y_cord):
        Maruspial._init_(self)
        self.x_cord=x_cord
        self.y_cord=y_cord
    def _repr_(self):
        return f'I am a Kangaroo located at coordinates{self.x_cord, self.y_cord}'
    def jump(self,dx,dy):
        self.x_cord+=dx
        self.y_cord+=dy
        
a= Maruspial()
a.put_in_pouch("Hello")
a.put_in_pouch("Hello1")
a.pouch_contents()

k=Kangaroo(10, 10)
print(k)
k.put_in_pouch("Hello")
k.put_in_pouch("Hello1")
k.pouch_contents()

k.jump(1, 2)
print(k)

SyntaxError: cannot assign to operator (<ipython-input-145-566e0253b597>, line 4)

In [146]:
words = ['The', 'quick', 'brown', 'fox', 'jumps', 'over',
'the', 'lazy', 'dog']
word = [x.upper() for x in words]
print(word)
word1 = [x.lower() for x in words]
print(word1)
num_words_list=[]
for words in words:
    num_words_list.append(len(words))
print(num_words_list)

['THE', 'QUICK', 'BROWN', 'FOX', 'JUMPS', 'OVER', 'THE', 'LAZY', 'DOG']
['the', 'quick', 'brown', 'fox', 'jumps', 'over', 'the', 'lazy', 'dog']
[3, 5, 5, 3, 5, 4, 3, 4, 3]

In [147]:
words = ['The', 'quick', 'brown', 'fox', 'jumps', 'over',
'the', 'lazy', 'dog']
stuff = [[w.upper(), w.lower(), len(w)] for w in words]
from pprint import pprint
pprint(stuff)

[['THE', 'the', 3],
 ['QUICK', 'quick', 5],
 ['BROWN', 'brown', 5],
 ['FOX', 'fox', 3],
 ['JUMPS', 'jumps', 5],
 ['OVER', 'over', 4],
 ['THE', 'the', 3],
 ['LAZY', 'lazy', 4],
 ['DOG', 'dog', 3]]